{
  "title": "3DRing: Enabling Low-Cost 3D Hand Position Tracking by Fusing Optical and Inertial Sensing\n",
  "duration": "May 2024 ‑ September 2024",
  "author_list": [
    {"Zhuojun Li": "#000000"},
    {"Chun Yu*": "#000000"},
    {"Chang Liu": "#1D67CD"},
    {"Lubin Wang": "#000000"},
    {"Mingyuan Du":  "#000000"},
    {"Weinan Shi":  "#000000"},
    {"Yuanchun Shi": "#000000"}
  ],
  "full_text": [
    {"paragraph": "Human hand tracking is a fundamental task in AR/VR, enabling natural 3D interactions. Current hand tracking systems primarily rely on high-framerate (HFR, e.g. 60 FPS) optical sensors to capture hand positions, which results in high computational costs and limits their applicability in end devices. To address this challenge, we propose 3DRing, a 3D hand position tracking method that requires only low-framerate (LFR, i.e. <10 FPS) optical data and a single IMU ring, achieving high hand tracking accuracy and interaction efficiency. Our method consists of two stages: (1) a Deep Extended Kalman Filter (DEKF) prediction stage, and (2) a Reinforcement Learning (RL) calibration stage. In the first stage, we use an RNN-based velocity prediction model and an EKF model to jointly predict high-framerate hand positions from a single LFR optical measurement. In the second stage, the RL model adaptively selects minimal optical keyframes for calibration, further reducing the average optical framerate. Evaluations demonstrate that both the DEKF and RL modules significantly enhance tracking performance. Using only 6.61 FPS (9.9%) optical data, 3DRing achieves an average real-time tracking error of 1.75+-0.18cm and an interaction speed of 86.0% in a 3D target selection task, compared to the 67 FPS built-in hand tracking system of the Meta Quest Pro. This shows the strong potential of our method to reduce the reliance on optical data in mobile hand tracking devices, making hand tracking technology more accessible to end users.\n\n"}
  ],
  "publication": {"description": "On Submission to UIST 2025", "link": ""},
  "cover": ""
}