{
  "title": "Understanding Overreliance on Conversational LLM based on Users’ Interaction Behaviors",
  "duration": "September 2024 - April 2025",
  "author_list": [
    {"Chang Liu": "#1D67CD"},
    {"Qinyi Zhou": "#000000"},
    {"Xinjie Shen": "#000000"},
    {"Xingyu Bruce Liu":  "#000000"},
    {"Sherry Tongshuang Wu": "#000000"},
    {"Xiang 'Anthony' Chen": "#000000"}
  ],
  "full_text": [
    {"paragraph": "Overreliance on Conversational LLM (e.g., ChatGPT) can degrade human-AI collaboration. In contrast to prior work that studied overreliance by measuring task outcome, we investigate how users’ interaction behaviors on a Conversational LLM interface (e.g., mouse\nand keyboard activities) correlate with their overreliance on AI. To achieve this, we collected a dataset of interaction behaviors logged from 77 participants interacting with a Conversational LLM manipulated to generate misinformation. Participants performed three tasks that required them to verify Conversational LLM responses using different information sources and decide whether and how to use the responses to complete the tasks. To analyze this data, we employ a transformer-based autoencoder to extract embeddings corresponding to different interaction behaviors. Through clustering analysis of these embeddings, We identified five distinctive behavior patterns correlated with overreliance. Our findings provide insights for better understanding the overreliance.\n\n"},
    {"image": "project-understanding_overreliance_image_1.png", "description": "Image 1: The AutoEncoder Structure We Used for Analysis. We first segmented the whole log into action sequence of different window length. Next, we transferred the action sequences into vectors. We use an autoencoder to reconstruct the vectors, and use the latent vector of each action sequence for clustering.\n\n"},
    {"image": "project-understanding_overreliance_image_2.png", "description": "Image 2: Visualization of various behavior clusters, with three columns respectively denoting Behavior Pattern, Task, and Visualization of Behavior Sequence. Sub-figures (a) to (e) correspond to distinct behavior patterns: (a) Frequency of Referring LLM Outputs: Shows how often users refer to LLM outputs during quiz solving task. (b) Continuous Modifications Following Each LLM Output: Depicts users’ repeated edits (keypress/delete) on the LLM page after idle (considering) on the Task page. More common in high-overreliance users. (c) Focused Task Comprehension at the Start: Highlights users’ concentrated reading (mousewheel/idle) on the Task page at the task’s beginning, observed in article summarization. (d) Coarse- vs. Fine-Grained Locating & Editing: In tasks like trip planning, high-overreliance users use rough locating (lengthy copy/paste); low-overreliance users engage in precise editing (repeated mouse movement, keypress, click after scrolling). (e) Frequency of Copying-Pasting: In trip planning, high-reliance users frequently copy/paste unedited; low-overreliance users cautiously edit (keypress/delete).\n\n"}
  ],
  "publication": {"description": "On Submission to UIST 2025", "link": ""},
  "cover": "project-understanding_overreliance_cover.png"
}